const canvas1 = document.getElementById('canvas1');
const c = canvas1.getContext('2d');
canvas1.height = window.innerHeight/3;
canvas1.width = window.innerWidth;

const reci = ["компјутер","телефон","гитара","игрица","чичаглиша","столица","књига","слика","апарат","постер","фиока","планина","лишај","авокадо","путовање","авион", 
	"поручити", "атрактивност", "сазвати", "воће", "топалски", "централан", "запрежан", "неименован", "схватити", "ротирати",
	"принијети", "заслужити", "ножица", "атентаторски", "морати", "одрезан", "заглавље", "двобојан", "враголаст", "космат",
	"чардаш", "огњевит", "дијаграм", "домородац", "казански", "одахнути", "виртуоз", "клајић", "гнојан", "зазвучати",
	"ракоњчев", "тигров", "честитати", "груда", "громада", "обртно", "оперативан", "силник", "регион", "расцепан",
	"београдски", "обзнанити", "импоновати", "чувен", "јесенски", "интернационала", "додатак", "пролазити", "сењски", "укинути",
	"свестан", "ваљати", "пречишћавати", "лидски", "агентан", "дефектан", "ћеф", "порађати", "симболички", "мазница",
	"увалити", "удружен", "леарнинг", "препирати", "бегати", "совјетски", "идеолошки", "ломан", "ујак", "умерен",
	"чупав", "мирнији", "манометар", "кумановски", "капелник", "обрачун", "изгорети", "достизање", "теглица", "белоруски",
	"ливадски", "марширати", "окусити", "закопавати", "набацивати", "претеривати", "закорачити", "пооштравати", "гроздан", "чувство",
	"покварен", "узданица", "шутети", "мазга", "супарник", "динуловић", "дићи", "подеок", "хаџиница", "нестрпљив",
	"симонић", "тржни", "упростити", "мепор", "приступати", "коријера", "вајар", "одушевити", "ублажавати", "распрезати",
	"рушитељски", "руковаоц", "аривиста", "оживети", "матроза", "дупликат", "израњати", "лингвистика", "порезан", "помагати",
	"илегалац", "клавир", "водоскок", "мировати", "акредитив", "огњев", "евакуисати", "лија", "пребрисати", "закрћен", "милити",
	"акцесиони", "пљувати", "повезивање", "поштовање", "испуњен", "баталити", "чланак", "тир", "палићки", "пожељети",
	"гегати", "товни", "дограђивати", "изгарати", "либретист", "кристализација", "ризичан", "цукар", "куглашки", "подмитити",
	"суд", "наводњавање", "онтолошки", "топионица", "петљавина", "стреха", "ширити", "принципијелан", "станка", "ужички",
	"издирати", "остарети", "мајда", "робљен", "нањушити", "усаглашен", "растрзан", "убачен", "зијати",
	"масивност", "ров", "бубањски", "предсказање", "српски", "насећи", "фаличан", "дробњак", "пребивати", "дугуљаст",
	"мундијал", "мерџан", "кидати", "подчинити", "отегнут", "подбочити", "бурзан", "пуцати", "ветерин", "намастир",
	"бесмртан", "каролина", "беспримеран", "прекратити", "невољник", "сухомеснат", "кориговати", "саиграч", "обзиђати", "уручити",
	"муштрати", "арсеник", "враћати", "даривати", "заштитница", "гајба", "лечити", "томчић", "благодушан", "дијалект",
	"уживати", "стилизовати", "бивши", "привредљив", "обрушавати", "садржавати", "ухватити", "фараонов", "срезаност", "едукативан",
	"мазнути", "застрашујући", "престати", "неодређен", "зажалити", "влканов", "разбити", "мода", "заповест", "четвртаст",
	"грм", "ждребљење", "прецизан", "разбијати", "рекетирати", "мирсад", "кашњење", "заглушан", "медијум", "неисправан",
	"избечен", "зажелети", "придавати", "ушивати", "опстојати", "замењивати", "иситњен", "литанија", "експортан", "примјеран",
	"умножавати", "мелодрама", "учкур", "компоновати", "оштрити", "занемарити", "лавабо", "посетилац", "ускладиштење", "длето",
	"љутити", "хилендар", "пресветао", "валија", "базићан", "разлог", "екстензиван", "колебати", "усидрити", "гласати",
	"нерадин", "реџеп", "парадржава", "маљ", "усмеравати", "забрањивати", "освештан", "размажен", "условност", "шкљоцнути",
	"софист", "линијски", "избирач", "опанчар", "ванцаг", "лансиран", "електрон", "откровење", "божји", "придобити",
	"инстанца", "измишљати", "вољен", "ишчекивати", "оплеменити", "полусенка", "упећи", "славан", "бенд", "филистар",
	"напитак", "вез", "збиља", "евакуисати", "спрема", "пгп", "милиционер", "мајолика", "пресвет", "поразан",
	"пројара", "утицати", "колут", "анимација", "разгалити", "дозволити", "шуматовачки", "кандидат", "обузети", "смућивати",
	"доступан", "махнити", "брбљати", "серенада", "овлашан", "кобан", "казашка", "предњачити", "преклањски", "упутан",
	"словенство", "дељење", "хомбах", "тракториста", "усадити", "елиса", "кића", "узвратити", "узвикивати", "претресати",
	"хоризонталан", "синтаксички", "тугаљив", "најздравији", "чехов", "конопац", "услован", "вештачки", "павка", "мелети",
	"помакнути", "поруменети", "кнесет", "збунити", "сићан", "брежуљак", "асирски", "накупљати", "претња", "оживети",
	"истргнути", "растројен", "пушчан", "раширивати", "снажан", "пешкир", "чедан", "начети", "воћњак", "паковање",
	"стенографисати", "гладовање", "мирисати", "спокој", "тајновит", "лепак", "одвајати", "последњи", "сместити", "етнолошки",
	"мекан", "збуњен", "гласност", "истакнути", "клинаст", "завештан", "смрешкан", "рви", "вирџински", "трбоња",
	"доушник", "тробојка", "изазвати", "мизеран", "митски", "здравица", "виталност", "додир", "покушавати", "мрмољити",
	"кутаиси", "обилазак", "шестарити", "шукиловић", "отрезан", "окретање", "ивањски", "образовати", "локва", "наставити",
	"очитовати", "метнути", "понашање", "одагнати", "десан", "брснат", "почети", "начети", "нано", "постхуман",
	"ронити", "избавити", "лучан", "засметати", "мравојед", "хидрометеоролошки", "тесати", "акредитован", "накинђурен", "потајан",
	"јагњетина", "летети", "ачански", "мост", "спрдати", "ужаснут", "звати", "глорија", "развојан", "симултаност",
	"хазнадар", "конфузија", "маровац", "потресати", "коначан", "саблазан", "ироничан", "расположен", "иселити", "крсна",
	"пловидба", "потамнети", "процена", "чепркати", "преводан", "грчење", "дагња", "светковати", "подесити", "подвлачење",
	"предраг", "злослутан", "вајат", "рањав", "евалуирање", "закриљивати", "луцкаст", "затрован", "прибојавати", "знојав",
	"срдити", "остати", "разгнати", "поучен", "прилаз", "напорнији", "тамнина", "ранити", "убеђивати", "праведник",
	"прозивник", "десити", "реванширати", "врхован", "братић", "првостепен", "прегнантан", "блудан", "роварити", "прхнути",
	"свргавати", "недељив", "однос", "дешавати", "додиривати", "разлог", "исисавати", "пргав", "никонор", "денар",
	"митраљез", "боравишан", "ваљевац", "берач", "озваничавати", "битанга", "улагати", "верификациони", "кардинал", "захваљивати",
	"иновациони", "мена", "увек", "фрлог", "угрожавати", "опипати", "обешен", "час", "примедба", "окренути",
	"отимати", "коњушница", "ненаставан", "храпав", "начудити", "мартинић", "бешикташ", "подгревати", "одаслати", "хамбургер",
	"жалобан", "засметати", "инкубатор", "ршум", "изнајмити", "преверица", "варилачки", "проширивати", "питање", "аперкат",
	"распремати", "плебисцит", "режиран", "осрамоћење", "неједнак", "многи", "пантић", "падати", "избеглица", "поморити",
	"издржати", "јорган", "цврчати", "хировит", "плузати", "верен", "погурен", "говорница", "повраћати", "директан",
	"азбука", "колико", "пијуцкати", "култивирати", "блеснути", "бомба", "десетерац", "деспотски", "просед", "изнијети",
	"неотесан", "сарадник", "моделар", "претицати", "светлити", "цедило", "плести", "унижавати", "одрезати", "болештина",
	"спасти", "обавештавање", "лек", "туговати", "пружити", "ћерамида", "изливати", "касни", "заблесавити", "жигосати",
	"будала", "хума", "деветорица", "настањивати", "аналоган", "надувавати", "алигатор", "момаштво", "одвајати", "мрзнути",
	"испружити", "наметати", "сутра", "шампионка", "друмски", "нестати", "ћушкати", "каракаш", "жмирети", "помоћи",
	"обровац", "приговорити", "подилазити", "осојан", "козица", "ономадашњи", "хистеричан", "прободити", "потекло", "дуалан",
	"слависта", "сретенов", "флекица", "опоменути", "заиграти", "огртач", "предводити", "хитац", "премостити", "лип",
	"хлор", "жлеб", "надговорити", "говеђина", "сачекивати", "микроорганизам", "поставити", "мајоран", "разложити", "издробити",
	"штрикање", "флег", "двотоман", "пашиница", "прислужити", "медаљон", "љубити", "плутача", "демонстрација", "облизати",
	"непокопан", "кола", "саксофон", "куд", "поимати", "натоварен", "обезбеђивање", "коњички", "сиротињски", "премирати",
	"солитер", "условити", "потуцати", "сомотски", "прекрити", "кобранко", "инпут", "оваплоћен", "савина", "уређен",
	"увређен", "поверавање", "цветићанин", "милисав", "дум", "таман", "протиснути", "медачки", "страховати", "служећи",
	"десетица", "венути", "старати", "жандармски", "удовица", "празнити", "муслиман", "виђати", "одбијати", "крвожедан",
	"уклонити", "киндер", "планинка", "вебија", "најопакији", "величанственост", "клинац", "керамика", "укоријенити", "макнути",
	"делити", "треш", "солипсизам", "заокренути", "подигнути", "треска", "ламартин", "марна", "завођење", "рекордан",
	"распитивати", "гнев", "обијен", "шапутати", "општење", "ренин", "главнина", "нераван", "упињати", "апулијски",
	"узимати", "завити", "шокантан", "наметнути", "атомски", "повремен", "амос", "удес", "цео", "вучићев",
	"откопчавати", "морелиа", "никому", "несмишљен", "припијен", "изругивати", "изузети", "постојећи", "плаштаница", "балега",
	"калинин", "белетристички", "убрус", "реченица", "подударати", "слободан", "спасен", "погубити", "осветљавати", "признати",
	"цртица", "савременик", "мекнути", "угњетачки", "нетелесан", "фактичан", "туба", "метафоричан", "зависити", "алва",
	"титула", "неизмеран", "набрати", "геометријски", "заобићи", "крављи", "поседник", "астралан", "келнеров", "јануар",
	"огрејати", "неред", "ћелијски", "удаљавати", "разбијачки", "трагати", "камеја", "изјаснити", "стамница", "застој",
	"саздан", "надимак", "ловица", "јуфка", "далекосежан", "пронаћи", "афераш", "плесати", "штрикан", "реаговати",
	"љуљашка", "тетива", "невеста", "пилот", "дрзак", "страствен", "попити", "сиромашан", "отшкринути", "испирач",
	"забрадити", "сладолед", "југозапад", "имућан", "забава", "одрасли", "холокауст", "обмотај", "жезло", "подрхтавати",
	"превентиван", "похапсити", "паклен", "чаврљати", "извршан", "недокучив", "гад", "девојче", "четиристо", "одвратан",
	"књижица", "бојев", "аутомобил", "парковски", "уливати", "посуђен", "аустроугарски", "књиговодствен", "рашчешљати", "трсити",
	"изучавати", "одбитак", "прогласити", "пачји", "безводан", "хуљење", "дешњак", "грађевинац", "гребуцкати", "полигон",
	"рачански", "оргазам", "мраморан", "мозак", "генијалан", "ракун", "клецнути", "никла", "кревељити", "просути",
	"ретрада", "огртати", "соколски", "бошковски", "харем", "дистрибуирати", "седморо", "разменити", "купити", "отпочети",
	"оборити", "превелик", "резан", "камен", "купачица", "достижан", "филмски", "шимун", "фенички", "исцепан",
	"коморџија", "чудњак", "арапски", "муштрати", "арсеник", "враћати", "даривати", "заштитница", "гајба", "лечити",
	"томчић", "благодушан", "дијалект", "уживати", "стилизовати", "бивши", "привредљив", "обрушавати", "садржавати", "ухватити",
	"фараонов", "срезаност", "едукативан", "мазнути", "застрашујући", "престати", "неодређен", "зажалити", "влканов", "разбити",
	"мода", "заповест", "четвртаст", "грм", "ждребљење", "прецизан", "разбијати", "рекетирати", "мирсад", "кашњење",
	"заглушан", "медијум", "неисправан", "избечен", "зажелети", "придавати", "ушивати", "опстојати", "замењивати", "иситњен",
	"литанија", "експортан", "примјеран", "умножавати", "мелодрама", "учкур", "компоновати", "оштрити", "занемарити", "лавабо",
	"посетилац", "ускладиштење", "длето", "љутити", "хилендар", "пресветао", "валија", "базићан", "разлог", "екстензиван",
	"колебати", "усидрити", "гласати", "нерадин", "реџеп", "парадржава", "маљ", "усмеравати", "забрањивати", "освештан",
	"размажен", "условност", "шкљоцнути", "софист", "линијски", "избирач", "опанчар", "ванцаг", "лансиран", "електрон",
	"откровење", "божји", "придобити", "инстанца", "измишљати", "вољен", "ишчекивати", "оплеменити", "полусенка", "упећи",
	"славан", "бенд", "филистар", "напитак", "вез", "збиља", "евакуисати", "спрема", "пгп", "милиционер",
	"мајолика", "пресвет", "поразан", "пројара", "утицати", "колут", "анимација", "разгалити", "дозволити", "шуматовачки",
	"кандидат", "обузети", "смућивати", "доступан", "махнити", "брбљати", "серенада", "овлашан", "кобан", "казашка",
	"предњачити", "преклањски", "упутан", "словенство", "дељење", "хомбах", "тракториста", "усадити", "елиса", "кића",
	"узвратити", "узвикивати", "претресати", "хоризонталан", "синтаксички", "тугаљив", "најздравији", "чехов", "конопац", "услован",
	"вештачки", "павка", "мелети", "помакнути", "поруменети", "кнесет", "збунити", "сићан", "брежуљак", "асирски",
	"накупљати", "претња", "оживети", "истргнути", "растројен", "пушчан", "раширивати", "снажан", "пешкир", "чедан",
	"начети", "воћњак", "паковање", "стенографисати", "гладовање", "мирисати", "спокој", "тајновит", "лепак", "одвајати",
	"последњи", "сместити", "етнолошки", "мекан", "збуњен", "гласност", "истакнути", "клинаст", "завештан", "смрешкан",
	"рви", "вирџински", "трбоња", "доушник", "тробојка", "изазвати", "мизеран", "митски", "здравица", "виталност",
	"додир", "покушавати", "мрмољити", "кутаиси", "обилазак", "шестарити", "шукиловић", "отрезан", "окретање", "ивањски",
	"образовати", "локва", "наставити", "очитовати", "метнути", "понашање", "одагнати", "десан", "брснат", "почети",
	"начети", "нано", "постхуман", "ронити", "избавити", "лучан", "засметати", "мравојед", "хидрометеоролошки", "тесати",
	"акредитован", "накинђурен", "потајан", "јагњетина", "летети", "ачански", "мост", "спрдати", "ужаснут", "звати",
	"глорија", "развојан", "симултаност", "хазнадар", "конфузија", "маровац", "потресати", "коначан", "саблазан", "ироничан",
	"расположен", "иселити", "крсна", "пловидба", "потамнети", "процена", "чепркати", "преводан", "грчење", "дагња",
	"светковати", "подесити", "подвлачење", "предраг", "злослутан", "вајат", "рањав", "евалуирање", "закриљивати", "луцкаст",
	"затрован", "прибојавати", "знојав", "срдити", "остати", "разгнати", "поучен", "прилаз", "напорнији", "тамнина",
	"ранити", "убеђивати", "праведник", "прозивник", "десити", "реванширати", "врхован", "братић", "првостепен", "прегнантан",
	"блудан", "роварити", "прхнути", "свргавати", "недељив", "однос", "дешавати", "додиривати", "разлог", "исисавати",
	"пргав", "никонор", "денар", "митраљез", "боравишан", "ваљевац", "берач", "озваничавати", "битанга", "улагати",
	"захваљивати", "иновациони", "мена", "увек", "фрлог", "угрожавати", "опипати", "обешен", "час", "примедба",
	"окренути", "отимати", "коњушница", "ненаставан", "храпав", "начудити", "мартинић", "бешикташ", "подгревати", "одаслати",
	"хамбургер", "жалобан", "инкубатор", "ршум", "изнајмити", "преверица", "варилачки", "проширивати", "питање", "аперкат",
	"распремати", "плебисцит", "режиран", "осрамоћење", "неједнак", "многи", "пантић", "падати", "избеглица", "поморити",
	"издржати", "јорган", "цврчати", "хировит", "плузати", "верен", "погурен", "говорница", "повраћати", "директан",
	"азбука", "колико", "пијуцкати", "култивирати", "блеснути", "бомба", "десетерац", "деспотски", "просед", "изнијети",
	"неотесан", "сарадник", "моделар", "претицати", "светлити", "цедило", "плести", "унижавати", "одрезати", "болештина",
	"спасти", "обавештавање", "лек", "туговати", "пружити", "ћерамида", "изливати", "касни", "заблесавити", "жигосати",
	"будала", "хума", "деветорица", "настањивати", "аналоган", "надувавати", "алигатор", "момаштво", "мрзнути", "испружити",
	"наметати", "сутра", "шампионка", "друмски", "нестати", "ћушкати", "каракаш", "жмирети", "помоћи", "обровац",
	"приговорити", "подилазити", "осојан", "козица", "ономадашњи", "хистеричан", "прободити", "потекло", "дуалан", "слависта",
	"сретенов", "флекица", "опоменути", "заиграти", "огртач", "предводити", "хитац", "премостити", "лип", "хлор",
	"жлеб", "надговорити", "говеђина", "сачекивати", "микроорганизам", "поставити", "мајоран", "разложити", "издробити", "штрикање",
	"флег", "двотоман", "пашиница", "прислужити", "медаљон", "љубити", "плутача", "демонстрација", "облизати", "непокопан",
	"кола", "саксофон", "куд", "поимати", "натоварен", "обезбеђивање", "коњички", "сиротињски", "премирати", "солитер",
	"условити", "потуцати", "сомотски", "прекрити", "кобранко", "инпут", "оваплоћен", "савина", "уређен", "увређен",
	"поверавање", "цветићанин", "милисав", "дум", "таман", "протиснути", "медачки", "страховати", "служећи", "десетица",
	"венути", "старати", "жандармски", "удовица", "празнити", "муслиман", "виђати", "одбијати", "крвожедан", "уклонити",
	"киндер", "планинка", "вебија", "најопакији", "величанственост", "клинац", "керамика", "укоријенити", "макнути", "делити",
	"треш", "солипсизам", "заокренути", "подигнути", "треска", "ламартин", "марна", "завођење", "рекордан", "распитивати",
	"гнев", "обијен", "шапутати", "општење", "ренин", "главнина", "нераван", "упињати", "апулијски", "узимати",
	"завити", "шокантан", "наметнути", "атомски", "повремен", "амос", "удес", "цео", "вучићев", "откопчавати",
	"морелиа", "никому", "несмишљен", "припијен", "изругивати", "изузети", "постојећи", "плаштаница", "балега", "калинин",
	"белетристички", "убрус", "реченица", "подударати", "слободан", "спасен", "погубити", "осветљавати", "признати", "цртица",
	"савременик", "мекнути", "угњетачки", "нетелесан", "фактичан", "туба", "метафоричан", "зависити", "алва", "титула",
	"неизмеран", "набрати", "геометријски", "заобићи", "крављи", "поседник", "астралан", "келнеров", "јануар", "огрејати",
	"неред", "ћелијски", "удаљавати", "разбијачки", "трагати", "камеја", "изјаснити", "стамница", "застој", "саздан",
	"надимак", "ловица", "јуфка", "далекосежан", "пронаћи", "афераш", "плесати", "штрикан", "реаговати", "љуљашка",
	"тетива", "невеста", "пилот", "дрзак", "страствен", "попити", "сиромашан", "отшкринути", "испирач", "забрадити",
	"сладолед", "југозапад", "имућан", "забава", "одрасли", "холокауст", "обмотај", "жезло", "подрхтавати", "превентиван",
	"лучама", "рудница", "светомржња", "почетан", "поносит", "несвестица", "жупски", "континуум", "отворити", "четвртина",
	"бештија", "дивергентан", "роваш", "примирити", "правовремен", "политичан", "угасити", "жичара", "морепловац", "рустичан",
	"парни", "двотачка", "гаталица", "секуларан", "громак", "број", "физика", "седмични", "колхозни", "општи",
	"було", "месец", "саздавање", "обесмрћивати", "недирнут", "кадија", "ждрао", "оглушити", "елоквенција", "информисати",
	"електризирати", "зити", "фигуративност", "прећи", "прошарати", "егоиста", "погодност", "неспреман", "кекс", "матура",
	"бравица", "глатак", "унети", "згрчен", "неизмењен", "измишљавати", "престон", "шљунак", "опсадни", "патернитет",
	"омражен", "мир", "аларм", "аранжирати", "уперити", "преглед", "логика", "исткивати", "идеологија", "лебдети",
	"нарикати", "многоугао", "антика", "документаран", "поднети", "крешимиров", "живост", "најдраматичнији", "виртуелан", "фолклористички",
	"нередован", "ној", "обданиште", "утрчати", "њихање", "хохштаплерски", "неукротљив", "откован", "безопасан", "запаљив",
	"породичан", "забављање", "цементан", "појачавати", "растурен", "сантиметарски", "звонарев", "усправљен", "рецепција", "буртон"
];

Igraj(reci);
let dugme = document.getElementById('reset');
dugme.addEventListener("click", function(event){
	Igraj(reci);
});

function DeoTela(i){
	switch(i){
		case 1:
			c.beginPath();
			c.arc(200, 70, 20, 0, Math.PI * 2);
			c.stroke();
			break;
		case 2:
			c.moveTo(200,90);
			c.lineTo(200,140);
			c.stroke();
			break;
		case 3:
			c.moveTo(200,140);
			c.lineTo(180,175);
			c.stroke();
			break;
		case 4:
			c.moveTo(200,140);
			c.lineTo(220,175);
			c.stroke();
			break;
		case 5:
			c.moveTo(200,100);
			c.lineTo(175,125);
			c.stroke();
			break;
		case 6:
			c.moveTo(200,100);
			c.lineTo(225,125);
			c.stroke();
			break;
	}
}

function Igraj(reci){
	let slovaD = "абвгдђежзиијклљмнњопрстћуфхцчџш";
	for(let slovo of slovaD){
    	let dugme = document.getElementById(slovo);
    	dugme.classList.remove("clicked", "pogresno", "pogodjeno");
	}

	c.clearRect(0, 0, canvas1.width, canvas1.height);
	c.strokeStyle = 'black';
	c.lineWidth = 2;

	c.beginPath();
	c.moveTo(100, 20);
	c.lineTo(100, 200);

	c.moveTo(100, 20);
	c.lineTo(200, 20);

	c.moveTo(200, 20);
	c.lineTo(200, 50);

	c.moveTo(80, 200);
	c.lineTo(120, 200);
	c.stroke();

	const rec = reci[Math.floor(Math.random() * reci.length)];
	c.font = "40px Arial";
	c.fillStyle = 'black';
	c.fillText("_ ".repeat(rec.length),200,200);
	let greske = 0;
	let pogodjeno = 0;
	let gubi = false;
	let pobedjuje = false;

	c.font = "30px Arial";
	for(let slovo of slovaD){
		let dugme = document.getElementById(slovo);
		dugme.addEventListener("click", function(event){
			if(gubi || pobedjuje) return;
			if (dugme.classList.contains("clicked")) return;

			dugme.classList.add("clicked");

			if(!rec.includes(slovo)){
				greske++;
				DeoTela(greske);
				dugme.classList.add("pogresno");
			}
			else{
				for (let j = 0; j < rec.length; j++) {
					if (rec[j] == slovo) {
						c.fillText(slovo.toUpperCase(),200+33.4*j,200);
						pogodjeno++;
						dugme.classList.add("pogodjeno");
					}	
				}
			}
			if(greske==6){
				c.font = "bold 20px Arial";
				c.fillText("реч је била: " + rec.toUpperCase(),300,150);
				c.fillStyle = 'red';
				c.font = "130px Arial";
				c.fillText("Упс, изгубио си!",300,120);
				gubi =true;
			}
			if(pogodjeno==rec.length){
				c.fillStyle = 'green';
				c.font = "130px Arial";
				c.fillText("Свака част!",300,120);
				pobedjuje = true;
			}
		});
	}

}